cpp/cpp.tex
% Created 2016-06-26 Sun 10:39
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Matt Hancock}
\date{}
\title{ACM C++ Guide}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{Introduction}
\label{sec-1}
Welcome to the ACM C++ guide, a manual for quickly learning C++
for mathematical and scientific computing applications. The goal of 
this guide is not to make you a C++ expert, but to quickly teach 
you enough of the C++ fundamentals and design patterns to help you 
off the ground. If you should like to go beyond this guide, a 
few references are listed below.

This guide is split into sections. The sections are ordered in such a way
that topics in later sections often depend on topics from previous ones. 
You'll find code snippets peppered throughout the sections. At the end of 
each major section, you'll find exercises for practice.

\subsection{A little about the language}
\label{sec-1-1}
Before you dive in, here is a little about the C++ programming language:

C++ is an extension of the C programming language. Both C and C++ are 
\textbf{statically-typed} and \textbf{compiled} languages, which means that the \textbf{type} 
of variables used in your source code must declared explicitly and is 
checked at when the program is compiled (i.e., translated into a machine 
executable file).

One (among many) difference between C++ and C, however, is that C++ provides 
many data structures for the object-oriented programming paradigm. This 
essentially allows the software writer (that's you) to create custom, complex, 
reusable data structures. The object-oriented paradigm is extremely useful, 
but we will only touch the surface of it in this guide.

\subsection{Additional references}
\label{sec-1-2}
\begin{itemize}
\item \href{http://cppreference.com}{C++ reference}
\item \href{http://www.cplusplus.com/doc/tutorial}{C++ tutorials}
\item \href{https://en.wikipedia.org/wiki/C\%2B\%2B}{C++ wiki}
\item \href{http://stackoverflow.com/questions/388242/the-definitive-c-book-guide-and-list}{A compiled list of C++ textbooks from stackoverflow}
\end{itemize}

\section{Getting started}
\label{sec-2}
The particular programming tools that you choose to use will
likely be largely influenced by the operating system that you use.
We will use free tools (often developed for GNU / Linux systems) in
this guide. These tools are mostly available in other (non UNIX-like)
operating systems as well. For example, on Windows, you could use
\href{https://www.cygwin.com/}{Cygwin}, or install a dual boot with some Linux distribution 
(e.g., \href{http://www.ubuntu.com/}{Ubuntu}). On the other hand, MAC OSX, being a BSD-derived system, 
has many of the required tools already available (although, a command 
line utility, \href{http://brew.sh}{Brew}, makes building and installing other tools quite simple).

In the following two sections, we'll talk about the two basic types of 
software that you'll need to begin writing C++ programs.

\subsection{Text editors}
\label{sec-2-1}

The text editor that you choose to use should be be any program 
capable of editing plain text files. However, you may find that it's 
more productive to write in an editor who offers features such as 
syntax highlighting, code-completion, bracket-matching, or other features. 
Here are some popular free text editors:

\begin{itemize}
\item \href{https://atom.io/}{Atom} is a recently open-sourced GUI editor which some have compared to the very popular non-free editor, \href{https://sublimetext.com}{Sublime Text}.
\item \href{https://www.gnu.org/software/emacs/}{Emacs} is another powerful editor, which allows for highly optimized workflows.
\item \href{https://wiki.gnome.org/Apps/Gedit}{Gedit} is a nice and simple GUI editor, which is the default in GNOME desktop environment.
\item \href{https://kate-editor.org}{Kate} is a another simple GUI editor, which is the default in the KDE desktop environment.
\item \href{http://www.vim.org}{Vim} is a modal editor with a steep learning curve. It offers highly efficient means to edit text, and is available (or it's predecessor, vi) by default on nearly all UNIX-like operating systems.
\end{itemize}

\subsection{Compilers}
\label{sec-2-2}

Second, you'll need a program called a \textbf{compiler}. A compiler translates 
the high-level C++ language into an executable program. In this guide, we 
will use the \texttt{g++} compiler which is freely available through the 
\href{https://gcc.gnu.org/}{gnu compiler collection (gcc)}.

\texttt{g++} is a program which you typically call from the command line, which 
takes as input, your C++ source code file, and produces as output, a 
binary executable file.

\subsection{Writing a program}
\label{sec-2-3}

Let's create our first C++ program, the obligatory "Hello, world!". First, 
fire-up your text editor and create a file called, \texttt{hello.cpp}, with the 
following contents:

\begin{verbatim}
1  #include <iostream>
2  
3  int main() {
4    std::cout << "Hello, world!";
5    return 0;
6  }
\end{verbatim}

Now, to compile the program, execute:

\begin{verbatim}
g++ hello.cpp
\end{verbatim}

Followed by:
\begin{verbatim}
./a.out
\end{verbatim}

By default, \texttt{g++} calls the resulting binary executable, \texttt{a.out}, but
you can specify a different output file name by using the \texttt{-o} flag:

\begin{verbatim}
g++ hello.cpp -o my_executable_file.bin
\end{verbatim}

Note that in Windows, executable files typically end in \texttt{.exe}. In Unix-like
systems, there is no particular file-extension type for executables.

\subsubsection{Deconstruction of the "Hello, world!" program}
\label{sec-2-3-1}
Let's look at this program line-by-line:

\begin{enumerate}
\item In line 1, we are including a library called \texttt{iostream}. A standard library (one that is included with C++) is usually included inside angular brackets. The \texttt{iostream} library is used for printing to the screen or prompting for user input.

\item Line 2 is blank. Whitespace is ignored in C++.

\item In line 3, we are declaring a function called \texttt{main} which has a return type of \texttt{int} (short for integer). Functions are followed by parentheses, listing their arguments (our \texttt{main} funcion has no arguments in this case), followed by the function body. The function body is enclosed by brackets. The function \texttt{main} is special - it is the main function (surprise) that is executed when you actually run your program.

\item In line 4, we are giving the \texttt{Hello, world!} string to an object called \texttt{cout}, which prints the string. Note that \texttt{cout} is prefixed by \texttt{std}. The syntax, \texttt{std::cout}, means that \texttt{cout} belongs to the \textbf{namespace} called \texttt{std}. Namespaces are mechanisms for preventing name conflicts.

\item In line 5, we return the value 0. This signifies to the program that called the executable \texttt{hello.cpp} program (the parent program, you could say) that our program exited successfully (i.e., without error).

\item Line 6 closes the the the body of the function, \texttt{main}.
\end{enumerate}

\section{Data types}
\label{sec-3}
As we \hyperref[sec-1-1]{discussed previously}, you must explicitly declare the type of a 
variable. So, in this section, we'll talk about the main variable 
types you'll use, namely boolean, integer, floating point types. In 
the section on \ref{sec-6}, we'll discuss how to build 
our own custom data types.
