cpp/cpp.org
** Boolean
A boolean data type is either =true= or =false=. There are a number of 
operators between these types, illustrated in the code snippet below 
(note that lines starting with =//= are comments are ignored by the 
compiler):

#+begin_src cpp -n
  bool a,b,c; // Declare the type of variables a, b, and c.
  a = true;
  b = false;

  // !  is logical negation when applied to a single variable.
  c = !a; // c is false.

  // && is logical and.
  c = (a && b); // c is false.

  // || is logical or.
  c = (a || b); // c is true.
#+end_src

We don't often use boolean variables by themselves, but rather as a result 
of comparing two other data types (such as comparing if one integer is less 
than another integer).

** Integer types

There are [[http://en.cppreference.com/w/cpp/language/types][a variety of integer types]] in C++. Below, we illustrate a 
couple. These can be modified further using the =short= and =long= 
keywords, changing the number of bytes occupied by the variable (and 
hence the maximum and minimum size the variable can take on).

#+begin_src cpp -n
    int a = 6; // initialize a to 6.
    unsigned int b = 7; // initialize b to 7.
    int c; // declare c to be an integer variable.

    a = 6;
    b = 7;

    c = a / b; // c is 0
    c = b / a; // c is 1
    c = b % a; // c is 1 (% is the integer remainder or modulo operator)
    c = a - b; // c is -1
    c = a > b; // c is 0 (boolean gets cast to integer)
    c = a < b; // c is 1 (boolean gets cast to integer)
    c++;       // c is 2 (++ is shorthand for c = c + 1)

    b = a - b; // b is 4294967295 (-1 gets cast to unsigned)
    b = b + 1; // b is 0 (b was previously the largest unsigned,
               // so adding one circles it back to zero.)
    b += 7;    // b is 7 (+= is shorthand for b = b + 7;
#+end_src

In the above, we've illustrated the use of signed and unsigned 
integer types and the operators between them. It is important to 
take care when you assign a result to a variable that doesn't match 
the type of the result. In many cases, the result gets implicitly 
cast to the type of variable being assigned to. The result may or 
may not match your expectations, as shown above.

** Floating point types
There are two main floating point data types in C++, =float= and =double=,
which correspond to [[https://en.wikipedia.org/wiki/IEEE_floating_point][IEEE 32- and 64-bit floating point types]]. 

#+begin_src cpp -n :exports both :results output
  #include <iostream>
  #include <limits>

  int main() {
    float a; //  Declare a single precision float.
    double b; // Declare a double precision float.

    // Print the max value of a float type.
    std::cout << std::numeric_limits<float>::max() << std::endl;

    // Print the max value of a double type.
    std::cout << std::numeric_limits<double>::max() << std::endl;

    // Print machine epsilon of a float type.
    std::cout << std::numeric_limits<float>::epsilon() << std::endl;

    // Print machine epsilon of a double type.
    std::cout << std::numeric_limits<double>::epsilon() << std::endl;

    return 0;
  }
#+end_src

#+RESULTS:
|  3.40282e+38 |
| 1.79769e+308 |
|  1.19209e-07 |
|  2.22045e-16 |


** Casting

Sometimes it is useful to explicitly cast one variable type as another. 
This can be done like the following:

#+begin_src cpp -n :includes <iostream> :exports both :output results
  int a; double b = 3.14159;

  a = (int) b;

  std::cout << a << std::endl;
#+end_src

#+RESULTS:
: 3

** The const modifier

If the value of some variable should not change, you can use the =const=
keyword to protect its status. It is typical to denote =const= variables 
with all caps. Try to compile the following program:

#+begin_src cpp -n
  const double PI = 3.14159;

  PI = 3.0;
#+end_src

You will see an error like, =error: assignment of read-only variable ‘PI’=. 

** The typedef keyword
Suppose you have a large numerical experiment, where all your code used 
floating point of type =double=. Your curious about how the results will 
be affected by changing the floating point type to single precision =float=
type. One solution would be to run a "find and replace" in your editor, but 
something about that doesn't feel right.

Instead, we can use the =typedef= statement to define types:

#+begin_src cpp -n
  // Define "int_type" to be a short int.
  typedef short int int_type;

  // Define "float_type" to be single precision float.
  typedef float float_type;

  // Define "array_index_type" to be unsigned long int.
  typedef unsigned long int array_index_type;

  int_type a = -17; 
  float_type b = 1.14; 
  array_index_type c = 9;
#+end_src

#+RESULTS:

** Pointers
Pointers are variables that hold the *memory address* for a variable 
of a specific type. Pointers are declared by specifying the variable 
type, followed by the =*= symbol, followed by the name of the pointer 
variable, e.g., =double * x= defines a "pointer to double" variable. 
The variable, =x=, therefore, does not hold the value of a =double= 
type, but rather, the memory address for a variable of type, =double=.
The memory address for a variable can be obtained by the =&= operator.

#+begin_src cpp -n :exports both :results output :includes <iostream>
  double * a;
  double b = 7;
  
  // This obtains the memory address of `b`.
  a = &b;
  
  // Prints some memory address (starts with 0x)
  std::cout << a << std::endl;
#+end_src

#+RESULTS:
: 0x7ffc9f2505a8

Similar to obtaining the memory address from a regular variable, using the
=&= operator, you can use the =*= symbol before a pointer to access the 
variable value held at the memory location of the pointer. In this context,
the =*= symbol is called the *dereference operator*. This is probably better 
understood with a short example:

#+begin_src cpp -n :includes <iostream> :exports both :results output
  double * a;
  double b = 7.3;
  double c;

  // Now `a` holds the memory address of `b`.
  a = &b;

  // `*a` obtains the value of the variable
  // at the memory address held by `a`.
  // So, `c` is 7.3.
  c = *a;

  std::cout << c << "\n";
#+end_src

#+RESULTS:
: 7.3

** Arrays
The length of an array can be fixed or dynamic, and how you
declare the array depends on this.

*** Fixed length arrays
#+begin_src cpp -n
double a[5];

a[0] = 1.0;
// etc.
#+end_src

#+RESULTS:

*** Dynamic length arrays
Dynamic length arrays are made possible through pointers:

#+begin_src cpp -n
  // This allocates memory for 5 double types.
  double * a = new double[5];

  // Afterwards, you can treat `a` like a normal array.
  a[0] = 1.0;
  // etc...

  // Whenever you use the `new` keyword, you must
  // delete the memory allocated when you're done by hand.
  delete [] a;

  // We can change the size of `a`.
  a = new double [10];

  a[0] = 2.0;
  // etc...

  delete [] a;
#+end_src

Note that omitting the first =delete= statement will cause no error. 
However, the memory allocated by the first =new= statement will not 
be freed, and thus inaccessible. This is bad because the memory cannot 
be allocated to other resources. You should generally try to avoid 
manually memory management when possible, but a good tool for debugging 
memory problems is called [[http://valgrind.org/][valgrind]]. 

#+RESULTS:

* Control structures
