cpp/cpp.tex

\subsection{Boolean}
\label{sec-3-1}
A boolean data type is either \texttt{true} or \texttt{false}. There are a number of 
operators between these types, illustrated in the code snippet below 
(note that lines starting with \texttt{//} are comments are ignored by the 
compiler):

\begin{verbatim}
 1  bool a,b,c; // Declare the type of variables a, b, and c.
 2  a = true;
 3  b = false;
 4  
 5  // !  is logical negation when applied to a single variable.
 6  c = !a; // c is false.
 7  
 8  // && is logical and.
 9  c = (a && b); // c is false.
10  
11  // || is logical or.
12  c = (a || b); // c is true.
\end{verbatim}

We don't often use boolean variables by themselves, but rather as a result 
of comparing two other data types (such as comparing if one integer is less 
than another integer).

\subsection{Integer types}
\label{sec-3-2}

There are \href{http://en.cppreference.com/w/cpp/language/types}{a variety of integer types} in C++. Below, we illustrate a 
couple. These can be modified further using the \texttt{short} and \texttt{long} 
keywords, changing the number of bytes occupied by the variable (and 
hence the maximum and minimum size the variable can take on).

\begin{verbatim}
 1  int a = 6; // initialize a to 6.
 2  unsigned int b = 7; // initialize b to 7.
 3  int c; // declare c to be an integer variable.
 4  
 5  a = 6;
 6  b = 7;
 7  
 8  c = a / b; // c is 0
 9  c = b / a; // c is 1
10  c = b % a; // c is 1 (% is the integer remainder or modulo operator)
11  c = a - b; // c is -1
12  c = a > b; // c is 0 (boolean gets cast to integer)
13  c = a < b; // c is 1 (boolean gets cast to integer)
14  c++;       // c is 2 (++ is shorthand for c = c + 1)
15  
16  b = a - b; // b is 4294967295 (-1 gets cast to unsigned)
17  b = b + 1; // b is 0 (b was previously the largest unsigned, so adding one circles it back to zero.)
18  b += 7;    // b is 7 (+= is shorthand for b = b + 7;
\end{verbatim}

In the above, we've illustrated the use of signed and unsigned 
integer types and the operators between them. It is important to 
take care when you assign a result to a variable that doesn't match 
the type of the result. In many cases, the result gets implicitly 
cast to the type of variable being assigned to. The result may or 
may not match your expectations, as shown above.

\subsection{Floating point types}
\label{sec-3-3}
There are two main floating point data types in C++, \texttt{float} and \texttt{double},
which correspond to \href{https://en.wikipedia.org/wiki/IEEE_floating_point}{IEEE 32- and 64-bit floating point types}. 

\begin{verbatim}
 1  #include <iostream>
 2  #include <limits>
 3  
 4  int main() {
 5    float a; //  Declare a single precision float.
 6    double b; // Declare a double precision float.
 7  
 8    // Print the max value of a float type.
 9    std::cout << std::numeric_limits<float>::max() << std::endl;
10    // prints 3.40282e+38
11  
12  
13    // Print the max value of a double type.
14    std::cout << std::numeric_limits<double>::max() << std::endl;
15    // prints 1.799769e+308
16  
17  
18    // Print machine epsilon of a float type.
19    std::cout << std::numeric_limits<float>::epsilon() << std::endl;
20    // prints 1.19209e-07
21  
22  
23    // Print machine epsilon of a double type.
24    std::cout << std::numeric_limits<double>::epsilon() << std::endl;
25    // prints 2.22045e-16
26  
27    return 0;
28  }
\end{verbatim}

\subsection{Casting}
\label{sec-3-4}

Sometimes it is useful to explicitly cast one variable type as another. 
This can be done like the following:

\begin{verbatim}
1  int a; double b = 3.14159;
2  
3  a = (int) b;
4  
5  std::cout << a << std::endl;
6  // prints 3
\end{verbatim}

\subsection{The const modifier}
\label{sec-3-5}

If the value of some variable should not change, you can use the \texttt{const}
keyword to protect its status. It is typical to denote \texttt{const} variables 
with all caps. Try to compile the following program:

\begin{verbatim}
1  const double PI = 3.14159;
2  
3  PI = 3.0;
\end{verbatim}

You will see an error like, \texttt{error: assignment of read-only variable ‘PI’}. 

\subsection{The typedef keyword}
\label{sec-3-6}
Suppose you have a large numerical experiment, where all your code used 
floating point of type \texttt{double}. Your curious about how the results will 
be affected by changing the floating point type to single precision \texttt{float}
type. One solution would be to run a "find and replace" in your editor, but 
something about that doesn't feel right.

Instead, we can use the \texttt{typedef} statement to define types:

\begin{verbatim}
 1  // Define "int_type" to be a short int.
 2  typedef short int int_type;
 3  
 4  // Define "float_type" to be single precision float.
 5  typedef float float_type;
 6  
 7  // Define "array_index_type" to be unsigned long int.
 8  typedef unsigned long int array_index_type;
 9  
10  int_type a = -17; 
11  float_type b = 1.14; 
12  array_index_type c = 9;
\end{verbatim}

\subsection{Pointers}
\label{sec-3-7}
Pointers are variables that hold the \textbf{memory address} for a variable 
of a specific type. Pointers are declared by specifying the variable 
type, followed by the \texttt{*} symbol, followed by the name of the pointer 
variable, e.g., \texttt{double * x} defines a "pointer to double" variable. 
The variable, \texttt{x}, therefore, does not hold the value of a \texttt{double} 
type, but rather, the memory address for a variable of type, \texttt{double}.
The memory address for a variable can be obtained by the \texttt{\&} operator.

\begin{verbatim}
1  double * a;
2  double b = 7;
3  
4  // This obtains the memory address of `b`.
5  a = &b;
6  
7  // Prints some memory address (starts with 0x)
8  std::cout << a << std::endl;
\end{verbatim}

Similar to obtaining the memory address from a regular variable, using the
\texttt{\&} operator, you can use the \texttt{*} symbol before a pointer to access the 
variable value held at the memory location of the pointer. In this context,
the \texttt{*} symbol is called the \textbf{dereference operator}. This is probably better 
understood with a short example:

\begin{verbatim}
 1  double * a;
 2  double b = 7.3;
 3  double c;
 4  
 5  // Now `a` holds the memory address of `b`.
 6  a = &b;
 7  
 8  // `*a` obtains the value of the variable
 9  // at the memory address held by `a`.
10  // So, `c` is 7.3.
11  c = *a;
\end{verbatim}

\subsection{Arrays}
\label{sec-3-8}
The length of an array can be fixed or dynamic, and how you
declare the array depends on this.

\subsubsection{Fixed length arrays}
\label{sec-3-8-1}
\begin{verbatim}
1  double a[5];
2  
3  a[0] = 1.0;
4  // etc.
\end{verbatim}

\subsubsection{Dynamic length arrays}
\label{sec-3-8-2}
Dynamic length arrays are made possible through pointers:

\begin{verbatim}
 1  // This allocates memory for 5 double types.
 2  double * a = new double[5];
 3  
 4  // Afterwards, you can treat `a` like a normal array.
 5  a[0] = 1.0;
 6  // etc...
 7  
 8  // Whenever you use the `new` keyword, you must
 9  // delete the memory allocated when you're done by hand.
10  delete [] a;
11  
12  // We can change the size of `a`.
13  a = new double [10];
14  
15  a[0] = 2.0;
16  // etc...
17  
18  delete [] a;
\end{verbatim}

Note that omitting the first \texttt{delete} statement will cause no error. 
However, the memory allocated by the first \texttt{new} statement will not 
be freed, and thus inaccessible. This is bad because the memory cannot 
be allocated to other resources. You should generally try to avoid 
manually memory management when possible, but a good tool for debugging 
memory problems is called \href{http://valgrind.org/}{valgrind}. 

\section{Control structures}
\label{sec-4}
