cpp/cpp.org
** Conditionals
Often a code block should only be executed if some condition is true. 
Below, we generate a random number between 0 and 1; print the number; and,
print whether or not the number was greater than 0.5.

#+begin_src cpp -n :exports both :results output
  #include <iostream>
  #include <stdlib.h>
  #include <time.h>

  int main() {
    // Seed the random number generator based on the current time.
    srand(time(NULL));

    // rand() produces a random integer between 0 and RAND_MAX.
    double num = rand() / ((double) RAND_MAX);

    std::cout << "num: " << num << "\n";

    if (num < 0.5) {
      std::cout << "num was less than 0.5.\n";
    }
    else {
      std::cout << "num was greater than 0.5.\n";
    }

    return 0;
  }
#+end_src

#+RESULTS:
: num: 0.11461
: num was less than 0.5.

You can follow =else= immediate by another =if= to have mutiple mutually-
exclusive blocks:

#+begin_src cpp -n :exports both :results output
  #include <iostream>
  #include <stdlib.h>
  #include <time.h>

  int main() {
    // Seed the random number generator based on the current time.
    srand(time(NULL));

    // rand() produces a random integer between 0 and RAND_MAX.
    double num = rand() / ((double) RAND_MAX);

    std::cout << "num: " << num << "\n";

    if (num >= 0.75) {
      std::cout << "num was between 0.75 and 1.\n";
    }
    else if (num >= 0.5) {
      std::cout << "num was between 0.5 and 0.75.";
    }
    else if (num >= 0.25) {
      std::cout << "num was between 0.25 and 0.5.";
    }
    else {
      std::cout << "num was between 0 and 0.25";
    }

    return 0;
  }
#+end_src

#+RESULTS:
: num: 0.372381
: num was between 0.25 and 0.5.

The conditions are checked in the order that they're written. So, for example,
in the second condition, we don't need to specify ~num >= 0.5 && num < 0.75~ 
because we know that this condition will only be checked if the previous 
was false.

** Loops
We discuss two main structures for iterating -- the =for= and =while= loops.

*** The for loop
The =for= loop requires three specifications -- the iteration variable 
initialization, the termination condition, and the update rule. The body
of the loop follows these three specifications. Shown below, we declare 
an array; assign to its components; and, print the current component to 
the screen.

#+begin_src cpp -n :includes <iostream> :results output :exports both
  int length = 11;
  double x[length];

  for(int i=0; i < length; i++) {
    // Assign to each array component.
    x[i] = (double) i / (length - 1);

    // Print the current component.
    std::cout << "x[" << i << "] = " << x[i] << std::endl;
  }
#+end_src

#+RESULTS:
#+begin_example
0
0.1
0.2
0.3
0.4
0.5
0.6
0.7
0.8
0.9
1
#+end_example

You can nest loops, i.e., loops inside of loops inside of ...

Below, is an example of a double loop for creating and accessing 
matrix data stored in a flat array. The matrix data is stored in 
[[https://en.wikipedia.org/wiki/Row-major-order][row-major order]]. This means the first =n_cols= elements of the 
array named, =matrix=, will contain the first row of the matrix, 
the second =n_cols= elements of =matrix= will contain the second row, etc...

#+begin_src cpp -n :includes <iostream> :exports both :results output
  int n_rows = 4;
  int n_cols = 3;

  // Row-major matrix array.
  double matrix [n_rows*n_cols];

  // temporary index.
  int k;

  for(int i=0; i < n_rows; i++) {
    for(int j=0; j < n_cols; j++) {
      // Convert the (i,j) matrix index to the "flat" row-major index.
      k = i*n_cols + j;

      // Assign a value of 1.0 to the diagonal,
      // 2 to the off-diagonal, and 0 otherwise.
      if (i == j) {
        matrix[k] = 1.0;
      }
      else if ((i == (j+1)) || (i == (j-1))){
        matrix[k] = 2.0;
      }
      else {
        matrix[k] = 0.0;
      }
    }
  }


  // Print the matrix elements.
  for(int i=0; i < n_rows; i++) {
    for(int j=0; j < n_cols; j++) {
      k = i*n_cols + j;

      std::cout << matrix[k];
      if (j != (n_cols-1)) {
        std::cout << ", ";
      }
    }

    if (i != (n_rows-1)) {
      std::cout << "\n";
    }
  }
#+end_src

#+RESULTS:
: 1, 2, 0
: 2, 1, 2
: 0, 2, 1
: 0, 0, 2

*** The while loop
A =while= loop iterates while a condition is met. Essentially, it is a =for=
loop without an update variable. In the following example, we approximate 
the geometric series:

$$
1 = \sum_{n=1}^{\infty} \left(\frac{1}{2}\right)^n
$$

The loop exits when the absolute error, 

$$
    \text{absolute error} := 1-\sum_{n=1}^N  \left(\frac{1}{2}\right)^n
$$

is less than some specified value, which we call `tol` (for tolerance).

#+begin_src cpp -n :includes <iostream> :exports both :results output
  double sum = 0.0;
  double base = 0.5;
  double pow = base; // initialize to base^1
  double tol = 1e-4;
  int iter = 1;

  while((1-sum) >= tol) {
    // Add `pow` to `sum`.
    sum += pow;
    // Update `pow` by one power of `base`.
    pow *= base;

    std::cout << "Iteration: " << iter << ", Sum: " << sum << "\n";
    // Update the `iter` val by 1.
    iter += 1;
  }
#+end_src

#+RESULTS:
#+begin_example
Iteration: 1, Sum: 0.5
Iteration: 2, Sum: 0.75
Iteration: 3, Sum: 0.875
Iteration: 4, Sum: 0.9375
Iteration: 5, Sum: 0.96875
Iteration: 6, Sum: 0.984375
Iteration: 7, Sum: 0.992188
Iteration: 8, Sum: 0.996094
Iteration: 9, Sum: 0.998047
Iteration: 10, Sum: 0.999023
Iteration: 11, Sum: 0.999512
Iteration: 12, Sum: 0.999756
Iteration: 13, Sum: 0.999878
Iteration: 14, Sum: 0.999939
#+end_example

*** The break keyword
The =break= keyword provides a mechanism for exiting the direct parent loop
for which the =break= statement is placed. For example:

#+begin_src cpp -n :results output :exports both :includes <iostream>
  for(int i=0; i < 3; i++) {
    while(true) {
      std::cout << "Entering infinite loop number " << (i+1) << "\n";
      break;
    }
    std::cout << "We escaped the infinite loop!\n";
  }
#+end_src

#+RESULTS:
: Entering infinite loop number 1
: We escaped the infinite loop!
: Entering infinite loop number 2
: We escaped the infinite loop!
: Entering infinite loop number 3
: We escaped the infinite loop!

The previous example is contrived, but there are situations, where you
might find the break statement within an infinite loop useful. Of course,
you should avoid this sort of thing if there is a more straight-forward 
approach.


** Exercises
1. Given integers, $n$ and $k$, write a program to compute the binomial coefficient, $\displaystyle {n \choose k}$.
2. The series, $\displaystyle \sum_{n=1}^{\infty} \frac{1}{n^2}$, converges to $\displaystyle\frac{\pi^2}{6}$. Create a program that approximates this series up to some specified tolerance, printing the absolute error at each iteration.
3. Fix numbers, $a$ and $b$. Let $x_0 = a$ and $x_N=b$. Let $\Delta x = \frac{b-a}{N}$ and $x_i = a + i \cdot \Delta x$, for $i = 0, 1, \ldots, N$. The left endpoint Riemann sum approximation to the integral, $\displaystyle\int_a^b x^2 dx$, is given by $\displaystyle\sum_{n=1}^N (x_i)^2 \Delta x$. Write a program with $a=0$ and $b=1$, which successively halves $\Delta x$ (starting from the initial value of $\Delta x = 0.5$) until the absolute error between the approximation and the true integral value is less than some specified tolerance. Record the absolute error at each iteration.
4. Maybe do something with a matrix.

* Functions
* Object-oriented programming
*   
#+html: </div>
