cpp/cpp.tex
\subsection{Conditionals}
\label{sec-4-1}
Often a code block should only be executed if some condition is true. 
Below, we generate a random number between 0 and 1; print the number; and,
print whether or not the number was greater than 0.5.

\begin{verbatim}
 1  #include <iostream>
 2  #include <stdlib.h>
 3  #include <time.h>
 4  
 5  int main() {
 6    // Seed the random number generator based on the current time.
 7    srand(time(NULL));
 8  
 9    // rand() produces a random integer between 0 and RAND_MAX.
10    double num = rand() / ((double) RAND_MAX);
11  
12    std::cout << "num: " << num << "\n";
13  
14    if (num < 0.5) {
15      std::cout << "num was less than 0.5.\n";
16    }
17    else {
18      std::cout << " was greater than 0.5.\n";
19    }
20  
21    return 0;
22  }
\end{verbatim}

You can follow \texttt{else} immediate by another \texttt{if} to have mutiple mutually-
exclusive blocks:

\begin{verbatim}
 1  #include <iostream>
 2  #include <stdlib.h>
 3  #include <time.h>
 4  
 5  int main() {
 6    // Seed the random number generator based on the current time.
 7    srand(time(NULL));
 8  
 9    // rand() produces a random integer between 0 and RAND_MAX.
10    double num = rand() / ((double) RAND_MAX);
11  
12    std::cout << "num: " << num << "\n";
13  
14    if (num >= 0.75) {
15      std::cout << "num was between 0.75 and 1.\n";
16    }
17    else if (num >= 0.5) {
18      std::cout << "num was between 0.5 and 0.75.";
19    }
20    else if (num >= 0.25) {
21      std::cout << "num was between 0.25 and 0.5.";
22    }
23    else {
24      std::cout << "num was between 0 and 0.25";
25    }
26  
27    return 0;
28  }
\end{verbatim}

The conditions are checked in the order that they're written. So, for example,
in the second condition, we don't need to specify \verb~num >= 0.5 && num < 0.75~ 
because we know that this condition will only be checked if the previous 
was false.

\subsection{Loops}
\label{sec-4-2}
We discuss two main structures for iterating -- the \texttt{for} and \texttt{while} loops.

\subsubsection{The for loop}
\label{sec-4-2-1}
The \texttt{for} loop requires three specifications -- the iteration variable 
initialization, the termination condition, and the update rule. The body
of the loop follows these three specifications. Shown below, we declare 
an array; assign to its components; and, print the current component to 
the screen.

\begin{verbatim}
 1  int length = 11;
 2  double x[length];
 3  
 4  for(int i=0; i < length; i++) {
 5    // Assign to each array component.
 6    x[i] = (double) i / (length - 1);
 7  
 8    // Print the current component.
 9    std::cout << "x[" << i << "] = " << x[i] << std::endl;
10  }
\end{verbatim}

\begin{verbatim}
x[0] = 0
x[1] = 0.1
x[2] = 0.2
x[3] = 0.3
x[4] = 0.4
x[5] = 0.5
x[6] = 0.6
x[7] = 0.7
x[8] = 0.8
x[9] = 0.9
x[10] = 1
\end{verbatim}

You can nest loops, i.e., loops inside of loops inside of \ldots{}

Below, is an example of a double loop for creating and accessing 
matrix data stored in a flat array. The matrix data is stored in 
\href{https://en.wikipedia.org/wiki/Row-major-order}{row-major order}. This means the first \texttt{n\_cols} elements of the 
array named, \texttt{matrix}, will contain the first row of the matrix, 
the second \texttt{n\_cols} elements of \texttt{matrix} will contain the second row, etc\ldots{}

\begin{verbatim}
 1  int n_rows = 4;
 2  int n_cols = 3;
 3  
 4  // Row-major matrix array.
 5  double matrix [n_rows*n_cols];
 6  
 7  // temporary index.
 8  int k;
 9  
10  for(int i=0; i < n_rows; i++) {
11    for(int j=0; j < n_cols; j++) {
12      // Convert the (i,j) matrix index to the "flat" row-major index.
13      k = i*n_cols + j;
14  
15      // Assign a value of 1.0 to the diagonal,
16      // 2 to the off-diagonal, and 0 otherwise.
17      if (i == j) {
18        matrix[k] = 1.0;
19      }
20      else if ((i == (j+1)) || (i == (j-1))){
21        matrix[k] = 2.0;
22      }
23      else {
24        matrix[k] = 0.0;
25      }
26    }
27  }
28  
29  
30  // Print the matrix elements.
31  for(int i=0; i < n_rows; i++) {
32    for(int j=0; j < n_cols; j++) {
33      k = i*n_cols + j;
34  
35      std::cout << matrix[k];
36      if (j != (n_cols-1)) {
37        std::cout << ", ";
38      }
39    }
40  
41    if (i != (n_rows-1)) {
42      std::cout << "\n";
43    }
44  }
\end{verbatim}

\begin{verbatim}
1, 2, 0
2, 1, 2
0, 2, 1
0, 0, 2
\end{verbatim}

\subsubsection{The while loop}
\label{sec-4-2-2}
A \texttt{while} loop iterates while a condition is met. Essentially, it is a \texttt{for}
loop without an update variable. In the following example, we approximate 
the geometric series:

$$
1 = \sum_{n=1}^{\infty} \left(\frac{1}{2}\right)^n
$$

The loop exits when the absolute error, 

$$
    \text{absolute error} := 1-\sum_{n=1}^N  \left(\frac{1}{2}\right)^n
$$

is less than some specified value, which we call `tol` (for tolerance).

\begin{verbatim}
 1  double sum = 0.0;
 2  double base = 0.5;
 3  double pow = base; // initialize to base^1
 4  double tol = 1e-4;
 5  int iter = 1;
 6  
 7  while((1-sum) >= tol) {
 8    // Add `pow` to `sum`.
 9    sum += pow;
10    // Update `pow` by one power of `base`.
11    pow *= base;
12  
13    std::cout << "Iteration: " << iter << ", Sum: " << sum << "\n";
14    // Update the `iter` val by 1.
15    iter += 1;
16  }
\end{verbatim}

\begin{verbatim}
Iteration: 1, Sum: 0.5
Iteration: 2, Sum: 0.75
Iteration: 3, Sum: 0.875
Iteration: 4, Sum: 0.9375
Iteration: 5, Sum: 0.96875
Iteration: 6, Sum: 0.984375
Iteration: 7, Sum: 0.992188
Iteration: 8, Sum: 0.996094
Iteration: 9, Sum: 0.998047
Iteration: 10, Sum: 0.999023
Iteration: 11, Sum: 0.999512
Iteration: 12, Sum: 0.999756
Iteration: 13, Sum: 0.999878
Iteration: 14, Sum: 0.999939
\end{verbatim}

\subsubsection{The break keyword}
\label{sec-4-2-3}
The \texttt{break} keyword provides a mechanism for exiting the direct parent loop
for which the \texttt{break} statement is placed. For example:

\begin{verbatim}
1  for(int i=0; i < 3; i++) {
2    while(true) {
3      std::cout << "Entering infinite loop number " << (i+1) << "\n";
4      break;
5    }
6    std::cout << "We escaped the infinite loop!\n";
7  }
\end{verbatim}

\begin{verbatim}
Entering infinite loop number 1
We escaped the infinite loop!
Entering infinite loop number 2
We escaped the infinite loop!
Entering infinite loop number 3
We escaped the infinite loop!
\end{verbatim}

The previous example is contrived, but there are situations, where you
might find the break statement within an infinite loop useful. Of course,
you should avoid this sort of thing if there is a more straight-forward 
approach.


\subsection{Exercises}
\label{sec-4-3}
\begin{enumerate}
\item Given integers, $n$ and $k$, write a program to compute the binomial coefficient, $\displaystyle {n \choose k}$.
\item The series, $\displaystyle \sum_{n=1}^{\infty} \frac{1}{n^2}$, converges to $\displaystyle\frac{\pi^2}{6}$. Create a program that approximates this series up to some specified tolerance, printing the absolute error at each iteration.
\item Fix numbers, $a$ and $b$. Let $x_0 = a$ and $x_N=b$. Let $\Delta x = \frac{b-a}{N}$ and $x_i = a + i \cdot \Delta x$, for $i = 0, 1, \ldots, N$. The left endpoint Riemann sum approximation to the integral, $\displaystyle\int_a^b x^2 dx$, is given by $\displaystyle\sum_{n=1}^N (x_i)^2 \Delta x$. Write a program with $a=0$ and $b=1$, which successively halves $\Delta x$ (starting from the initial value of $\Delta x = 0.5$) until the absolute error between the approximation and the true integral value is less than some specified tolerance. Record the absolute error at each iteration.
\item Maybe do something with a matrix.
\end{enumerate}

\section{Functions}
\label{sec-5}
\section{Object-oriented programming}
\label{sec-6}
\section{}
\label{sec-7}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
